src/Catalogs/КартыДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>КартыДоступа</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Блокировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Привязка</Name>
					<Comment>клиент, сотрудник, место</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПосадочныеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоШаблон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдноразовоеИспользование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКартДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/КартыДоступа/Ext/ObjectModule.bsl
// Обработчик события ПередЗаписью
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		
		Если НЕ ЗначениеЗаполнено(Наименование) Тогда
			Сообщить("Не заполнено наименование!",СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
			Сообщить("Не заполнен идентификатор карты!",СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
		//Если НЕ ЗначениеЗаполнено(ИнформационнаяБаза) Тогда
		//	Сообщить("Не заполнена ИБ карты!",СтатусСообщения.Важное);
		//	Отказ = Истина;
		//КонецЕсли;
		
		Если ЗначениеЗаполнено(Дата1) И ЗначениеЗаполнено(Дата2) И Дата1>Дата2 Тогда
			Сообщить("Указан некорректный период!",СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
		ПровСсылка = Ссылка;
		Если НЕ ПроверкаУникальностиРеквизитаСправочника(ПровСсылка, "Идентификатор", Идентификатор) Тогда
			Сообщить("Идентификатор уже использован в """+ПровСсылка.Наименование+"""", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Идентификатор1) Тогда
			Если НЕ ПроверкаУникальностиРеквизитаСправочника(ПровСсылка, "Идентификатор1", Идентификатор1) Тогда
				Сообщить("Идентификатор1 уже использован в """+ПровСсылка.Наименование+"""", СтатусСообщения.Важное);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(Идентификатор2) Тогда
			Если НЕ ПроверкаУникальностиРеквизитаСправочника(ПровСсылка, "Идентификатор2", Идентификатор2) Тогда
				Сообщить("Идентификатор2 уже использован в """+ПровСсылка.Наименование+"""", СтатусСообщения.Важное);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Привязка) И Не ПроверкаУникальностиРеквизитаСправочника(ПровСсылка, "Привязка", Привязка) Тогда
			Сообщить("Привязка уже использована в """ + СокрЛП(ПровСсылка.Наименование) + """", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Привязка= Неопределено;
	Идентификатор = "";
	Идентификатор1 = "";
	Идентификатор2 = "";
КонецПроцедуры

Процедура ПечатьКонверта() экспорт
	Перем Клиент;
	
	Если НЕ ЭтотОбъект.Привязка = Неопределено тогда
		Клиент = ЭтотОбъект.Привязка;
		// Вставить содержимое обработчика.
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Карты_Конверт";
		Макет = ПолучитьМакет("Конверт");
		
		Макет.Параметры.Наименование 	= Клиент.Наименование;
		Макет.Параметры.КартаДоступа 	= ""+ксТрактир.Число16в10(ксТрактир.Число10в16(Лев(ЭтотОбъект.Идентификатор,3))+ ксТрактир.Число10в16(Сред(Сокрлп(ЭтотОбъект.Идентификатор),4)));//ЭтотОбъект.Идентификатор;
		Макет.Параметры.Подразделение = ""+Клиент.Родитель.Родитель+","+Клиент.Родитель;
		
		ТабДокумент.Вывести(Макет);
		
		ТабДокумент.ОтображатьСетку = Ложь;
		ТабДокумент.ОтображатьЗаголовки = Ложь;
		
		ТабДокумент.Показать();
	иначе
		сообщить("Не установлена привязка к клиенту");
	КонецЕсли;
КонецПроцедуры
